#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/example-org-7cd94b/gh-actions-demo/runs/run-Znp6wm4Eoxk5vqKy

Waiting for the plan to start...

Terraform v1.1.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_region_network_endpoint_group.serverless_neg will be created
  + resource "google_compute_region_network_endpoint_group" "serverless_neg" {
      + id                    = (known after apply)
      + name                  = "serverless-neg"
      + network_endpoint_type = "SERVERLESS"
      + project               = (known after apply)
      + region                = "asia-northeast1"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "gateway-service"
        }
    }

  # module.lb-http.google_compute_backend_service.default["default"] will be created
  + resource "google_compute_backend_service" "default" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + enable_cdn                      = false
      + fingerprint                     = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "ms-service-backend-default"
      + port_name                       = (known after apply)
      + project                         = "gaudiy-integration-test"
      + protocol                        = (known after apply)
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
        }

      + cdn_policy {
          + cache_mode                   = (known after apply)
          + client_ttl                   = (known after apply)
          + default_ttl                  = (known after apply)
          + max_ttl                      = (known after apply)
          + negative_caching             = (known after apply)
          + serve_while_stale            = (known after apply)
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }

          + negative_caching_policy {
              + code = (known after apply)
              + ttl  = (known after apply)
            }
        }

      + log_config {
          + enable = false
        }
    }

  # module.lb-http.google_compute_global_address.default[0] will be created
  + resource "google_compute_global_address" "default" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "ms-service-address"
      + project            = "gaudiy-integration-test"
      + self_link          = (known after apply)
    }

  # module.lb-http.google_compute_global_forwarding_rule.http[0] will be created
  + resource "google_compute_global_forwarding_rule" "http" {
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "ms-service"
      + network               = (known after apply)
      + port_range            = "80"
      + project               = "gaudiy-integration-test"
      + self_link             = (known after apply)
      + target                = (known after apply)
    }

  # module.lb-http.google_compute_global_forwarding_rule.https[0] will be created
  + resource "google_compute_global_forwarding_rule" "https" {
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "ms-service-https"
      + network               = (known after apply)
      + port_range            = "443"
      + project               = "gaudiy-integration-test"
      + self_link             = (known after apply)
      + target                = (known after apply)
    }

  # module.lb-http.google_compute_managed_ssl_certificate.default[0] will be created
  + resource "google_compute_managed_ssl_certificate" "default" {
      + certificate_id            = (known after apply)
      + creation_timestamp        = (known after apply)
      + expire_time               = (known after apply)
      + id                        = (known after apply)
      + name                      = "ms-service-cert"
      + project                   = "gaudiy-integration-test"
      + self_link                 = (known after apply)
      + subject_alternative_names = (known after apply)
      + type                      = "MANAGED"

      + managed {
          + domains = [
              + "ms-service.app",
            ]
        }
    }

  # module.lb-http.google_compute_target_http_proxy.default[0] will be created
  + resource "google_compute_target_http_proxy" "default" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "ms-service-http-proxy"
      + project            = "gaudiy-integration-test"
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + self_link          = (known after apply)
      + url_map            = (known after apply)
    }

  # module.lb-http.google_compute_target_https_proxy.default[0] will be created
  + resource "google_compute_target_https_proxy" "default" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "ms-service-https-proxy"
      + project            = "gaudiy-integration-test"
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = (known after apply)
      + url_map            = (known after apply)
    }

  # module.lb-http.google_compute_url_map.default[0] will be created
  + resource "google_compute_url_map" "default" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "ms-service-url-map"
      + project            = "gaudiy-integration-test"
      + self_link          = (known after apply)
    }

  # module.lb-http.google_compute_url_map.https_redirect[0] will be created
  + resource "google_compute_url_map" "https_redirect" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "ms-service-https-redirect"
      + project            = "gaudiy-integration-test"
      + self_link          = (known after apply)

      + default_url_redirect {
          + https_redirect         = true
          + redirect_response_code = "MOVED_PERMANENTLY_DEFAULT"
          + strip_query            = false
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + load-balancer-ip = (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 10 estimated
           $0.0/mo +$0.0

```

</details>

*Pusher: @Nulandmori, Action: `pull_request`*